#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db]
azurerm_mssql_server.sql: Refreshing state... [id=/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021999999]
azurerm_service_plan.plan: Refreshing state... [id=/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-219076588]
azurerm_mssql_database.db: Refreshing state... [id=/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021999999/databases/ProductsDB]
azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/mywebapp-013579866676]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_linux_web_app.app has been deleted
  - resource "azurerm_linux_web_app" "app" {
      - app_settings                      = {
          - "SOME_KEY" = "some-value"
        } -> null
      - client_affinity_enabled           = false -> null
      - client_certificate_enabled        = false -> null
      - client_certificate_mode           = "Required" -> null
      - custom_domain_verification_id     = (sensitive value)
      - default_hostname                  = "mywebapp-013579866676.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/mywebapp-013579866676" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - kind                              = "app,linux" -> null
      - location                          = "westeurope" -> null
      - name                              = "mywebapp-013579866676" -> null
      - outbound_ip_address_list          = [
          - "108.142.57.96",
          - "108.142.57.101",
          - "108.142.57.102",
          - "108.142.57.104",
          - "108.142.57.108",
          - "108.142.57.113",
          - "108.142.56.229",
          - "108.142.56.235",
          - "108.142.56.254",
          - "108.142.57.0",
          - "108.142.57.14",
          - "108.142.57.38",
          - "20.105.224.48",
        ] -> null
      - outbound_ip_addresses             = "108.142.57.96,108.142.57.101,108.142.57.102,108.142.57.104,108.142.57.108,108.142.57.113,108.142.56.229,108.142.56.235,108.142.56.254,108.142.57.0,108.142.57.14,108.142.57.38,20.105.224.48" -> null
      - possible_outbound_ip_address_list = [
          - "108.142.57.96",
          - "108.142.57.101",
          - "108.142.57.102",
          - "108.142.57.104",
          - "108.142.57.108",
          - "108.142.57.113",
          - "108.142.56.229",
          - "108.142.56.235",
          - "108.142.56.254",
          - "108.142.57.0",
          - "108.142.57.14",
          - "108.142.57.38",
          - "108.142.57.65",
          - "108.142.57.67",
          - "108.142.57.68",
          - "108.142.57.71",
          - "108.142.57.73",
          - "108.142.57.74",
          - "108.142.57.76",
          - "108.142.57.79",
          - "108.142.57.80",
          - "108.142.57.87",
          - "108.142.57.90",
          - "108.142.57.92",
          - "108.142.57.116",
          - "108.142.57.125",
          - "108.142.57.131",
          - "108.142.57.132",
          - "108.142.57.134",
          - "108.142.57.138",
          - "20.105.224.48",
        ] -> null
      - possible_outbound_ip_addresses    = "108.142.57.96,108.142.57.101,108.142.57.102,108.142.57.104,108.142.57.108,108.142.57.113,108.142.56.229,108.142.56.235,108.142.56.254,108.142.57.0,108.142.57.14,108.142.57.38,108.142.57.65,108.142.57.67,108.142.57.68,108.142.57.71,108.142.57.73,108.142.57.74,108.142.57.76,108.142.57.79,108.142.57.80,108.142.57.87,108.142.57.90,108.142.57.92,108.142.57.116,108.142.57.125,108.142.57.131,108.142.57.132,108.142.57.134,108.142.57.138,20.105.224.48" -> null
      - resource_group_name               = "rg-terraform-web-sql-db" -> null
      - service_plan_id                   = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-219076588" -> null
      - site_credential                   = [
          - {
              - name     = "$mywebapp-013579866676"
              - password = "AA44tMyfL79b7308w7EwtocRhYdzndphzYr4g6pubjEqpwolwwnD3iLSvwC7"
            },
        ] -> null

      - auth_settings {
          - additional_login_parameters    = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
        }

      - connection_string {
          - name  = "Database" -> null
          - type  = "SQLAzure" -> null
          - value = (sensitive value)
        }

      - site_config {
          - always_on                               = true -> null
          - auto_heal_enabled                       = false -> null
          - container_registry_use_managed_identity = false -> null
          - default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> null
          - detailed_error_logging_enabled          = false -> null
          - ftps_state                              = "Disabled" -> null
          - health_check_eviction_time_in_min       = 0 -> null
          - http2_enabled                           = false -> null
          - ip_restriction                          = [] -> null
          - linux_fx_version                        = "DOTNETCORE|6.0" -> null
          - load_balancing_mode                     = "LeastRequests" -> null
          - local_mysql_enabled                     = false -> null
          - managed_pipeline_mode                   = "Integrated" -> null
          - minimum_tls_version                     = "1.2" -> null
          - remote_debugging_enabled                = false -> null
          - remote_debugging_version                = "VS2022" -> null
          - scm_ip_restriction                      = [] -> null
          - scm_minimum_tls_version                 = "1.2" -> null
          - scm_type                                = "None" -> null
          - scm_use_main_ip_restriction             = false -> null
          - use_32_bit_worker                       = true -> null
          - vnet_route_all_enabled                  = false -> null
          - websockets_enabled                      = false -> null
          - worker_count                            = 1 -> null

          - application_stack {
              - dotnet_version = "6.0" -> null
            }
        }
    }

  # azurerm_mssql_database.db has been deleted
  - resource "azurerm_mssql_database" "db" {
      - auto_pause_delay_in_minutes         = 0 -> null
      - collation                           = "SQL_Latin1_General_CP1_CI_AS" -> null
      - create_mode                         = "Default" -> null
      - geo_backup_enabled                  = true -> null
      - id                                  = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021999999/databases/ProductsDB" -> null
      - ledger_enabled                      = false -> null
      - max_size_gb                         = 250 -> null
      - min_capacity                        = 0 -> null
      - name                                = "ProductsDB" -> null
      - read_replica_count                  = 0 -> null
      - read_scale                          = false -> null
      - server_id                           = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021999999" -> null
      - sku_name                            = "S0" -> null
      - storage_account_type                = "Geo" -> null
      - transparent_data_encryption_enabled = true -> null
      - zone_redundant                      = false -> null

      - long_term_retention_policy {
          - monthly_retention = "PT0S" -> null
          - week_of_year      = 0 -> null
          - weekly_retention  = "PT0S" -> null
          - yearly_retention  = "PT0S" -> null
        }

      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = "Disabled" -> null
          - email_addresses      = [] -> null
          - retention_days       = 0 -> null
          - state                = "Disabled" -> null
        }
    }

  # azurerm_mssql_server.sql has been deleted
  - resource "azurerm_mssql_server" "sql" {
      - administrator_login                  = "user01" -> null
      - administrator_login_password         = (sensitive value)
      - connection_policy                    = "Default" -> null
      - fully_qualified_domain_name          = "terraform-sqlserver-021999999.database.windows.net" -> null
      - id                                   = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021999999" -> null
      - location                             = "westeurope" -> null
      - minimum_tls_version                  = "1.2" -> null
      - name                                 = "terraform-sqlserver-021999999" -> null
      - outbound_network_restriction_enabled = false -> null
      - public_network_access_enabled        = true -> null
      - resource_group_name                  = "rg-terraform-web-sql-db" -> null
      - restorable_dropped_database_ids      = [] -> null
      - version                              = "12.0" -> null
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db" -> null
      - location = "westeurope" -> null
      - name     = "rg-terraform-web-sql-db" -> null
      - tags     = {
          - "environment" = "preproduction"
        } -> null
    }

  # azurerm_service_plan.plan has been deleted
  - resource "azurerm_service_plan" "plan" {
      - id                           = "/subscriptions/fa95dc8e-624f-4828-9e0e-178a86b0c5e5/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-219076588" -> null
      - kind                         = "linux" -> null
      - location                     = "westeurope" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "appserviceplan-web-219076588" -> null
      - os_type                      = "Linux" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "rg-terraform-web-sql-db" -> null
      - sku_name                     = "B1" -> null
      - worker_count                 = 1 -> null
      - zone_balancing_enabled       = false -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_web_app.app will be created
  + resource "azurerm_linux_web_app" "app" {
      + app_settings                      = {
          + "SOME_KEY" = "some-value"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "mywebapp-013579866676"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-terraform-web-sql-db"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + connection_string {
          + name  = "Database"
          + type  = "SQLAzure"
          + value = (sensitive value)
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # azurerm_mssql_database.db will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = (known after apply)
      + collation                           = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = "LicenseIncluded"
      + max_size_gb                         = (known after apply)
      + min_capacity                        = (known after apply)
      + name                                = "ProductsDB"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = "S0"
      + storage_account_type                = "Geo"
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = false

      + long_term_retention_policy {
          + monthly_retention = (known after apply)
          + week_of_year      = (known after apply)
          + weekly_retention  = (known after apply)
          + yearly_retention  = (known after apply)
        }

      + short_term_retention_policy {
          + backup_interval_in_hours = (known after apply)
          + retention_days           = (known after apply)
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_mssql_server.sql will be created
  + resource "azurerm_mssql_server" "sql" {
      + administrator_login                  = "user01"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "westeurope"
      + minimum_tls_version                  = "1.2"
      + name                                 = "terraform-sqlserver-021999999"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "rg-terraform-web-sql-db"
      + restorable_dropped_database_ids      = (known after apply)
      + version                              = "12.0"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-terraform-web-sql-db"
      + tags     = {
          + "environment" = "preproduction"
        }
    }

  # azurerm_service_plan.plan will be created
  + resource "azurerm_service_plan" "plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "appserviceplan-web-219076588"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-terraform-web-sql-db"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ webapp_ips = "108.142.57.96,108.142.57.101,108.142.57.102,108.142.57.104,108.142.57.108,108.142.57.113,108.142.56.229,108.142.56.235,108.142.56.254,108.142.57.0,108.142.57.14,108.142.57.38,20.105.224.48" -> (known after apply)
  ~ webapp_url = "mywebapp-013579866676.azurewebsites.net" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @vaibhavpuri-hub, Action: `pull_request`, Working Directory: ``, Workflow: `Create Infra with Terraform`*